-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: May 09, 2025 at 05:43 PM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `iranianshop`
--

-- --------------------------------------------------------

--
-- Table structure for table `messages`
--

CREATE TABLE `messages` (
  `id` int(10) NOT NULL COMMENT 'کد پیام',
  `realname` varchar(70) NOT NULL COMMENT 'نام کامل',
  `email` varchar(50) NOT NULL COMMENT 'پست الکترونیک',
  `content` text NOT NULL COMMENT 'متن پیام'
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci COMMENT='جدول پیامها';

--
-- Dumping data for table `messages`
--

INSERT INTO `messages` (`id`, `realname`, `email`, `content`) VALUES
(1, 'علیرضا چوپانی', 'alirezachoupani4@gmail.com', 'عالی بود');

-- --------------------------------------------------------

--
-- Table structure for table `orders`
--

CREATE TABLE `orders` (
  `id` int(10) NOT NULL COMMENT 'شماره سفارش',
  `username` varchar(30) NOT NULL COMMENT 'نام کاربری سفارش دهنده',
  `orderdate` varchar(20) NOT NULL COMMENT 'تاریخ سفارش',
  `pro_id` int(10) NOT NULL COMMENT 'کد کالا',
  `pro_qty` int(10) NOT NULL COMMENT 'تعداد سفارش',
  `pro_price` float NOT NULL COMMENT 'قیمت پایه کالا',
  `number` varchar(11) NOT NULL COMMENT 'شماره تماس',
  `address` varchar(400) NOT NULL COMMENT 'آدرس',
  `trackcode` varchar(24) NOT NULL COMMENT 'کد مرسوله پستی',
  `state` int(1) NOT NULL COMMENT 'وضعیت سفارش'
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci COMMENT='جدول سفارشات';

--
-- Dumping data for table `orders`
--

INSERT INTO `orders` (`id`, `username`, `orderdate`, `pro_id`, `pro_qty`, `pro_price`, `number`, `address`, `trackcode`, `state`) VALUES
(1, 'AC7', '1404/02/19', 17, 1, 1510000, '09376432014', 'خ امام خمینی، خ درخشان', '395845721128626258437515', 0);

-- --------------------------------------------------------

--
-- Table structure for table `products`
--

CREATE TABLE `products` (
  `id` int(10) NOT NULL COMMENT 'کد کالا',
  `name` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT 'نام کالا',
  `qty` int(10) NOT NULL COMMENT 'موجودی کالا',
  `price` float NOT NULL COMMENT 'قیمت کالا',
  `image` varchar(80) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT 'عکس کالا',
  `details` text CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT 'توضیحات کالا'
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci COMMENT='جدول کالاها';

--
-- Dumping data for table `products`
--

INSERT INTO `products` (`id`, `name`, `qty`, `price`, `image`, `details`) VALUES
(1, 'جعبه خاتم کاری', 1, 250000, 'hoghe-choobi.jpg', 'یکی از محصولات خاتم‌کاری که هنرمند توانایی مانور دادن در نقش و نگار آن را دارد، جعبه‌ خاتم کاری است که به عنوان جعبه جواهرات خاتم‌کاری هم استفاده می‌شود. عموما می‌توانید نمونه‌های زیادی از این جعبه‌های زیبا با نقاشی‌های مینیاتوری در بین محصولات خاتم کاری اصفهان پیدا کنید.'),
(2, 'شطرنج و تخته نرد خاتم کاری', 3, 1650000, 'hoghe-jukkari.jpg', 'تخته نرد و شطرنج هر دو از بازی‌های سنتی و محبوبی هستند که تناسب هنری و تاریخی خوبی با هنر خاتم کاری دارند. تخته نرد خاتم کاری را هم می‌توان به عنوان هدیه ای نفیس در نظر گرفت.'),
(3, 'جعبه شکلات خوری خاتم کاری', 5, 450000, 'hoghe-khatamkari.jpg', 'یکی از محصولات محبوب دیگری که برای دکوراسیون خانه یا قرار دادن روی میز کاری مورد استفاده قرار می‌گیرد استفاده از جعبه خاتم‌کاری است که می‌توان به عنوان جعبه‌ی شکلات‌خوری، جعبه قاشق و… از آن استفاده کرد.'),
(4, 'سبد حصیری در دار', 3, 450000, 'kapoo.jpg', 'محصولات حصیری از جمله صنایع دستی پر طرفدار  است. این سبد های شیک، جهت نگهداری لباس، کفش، اسباب بازی، خرده وسایل اتاق و یا حتی رخت چرک ها نیز استفاده می شوند. به دلیل بافت حصیری این سبد، جریان هوا در این سبد به گردش در می آید. در دو طرف این سبد دسته مخفی طراحی کردیم که راحت تر آن را حمل کنید.\r\nاین صنایع دستی ارزشمند در شمال و جنوب ایران توسط مردمان بومی این سرزمین ساخته می شود.\r\nاز مزایای سبد های حصیری می توان به این نکته اشاره کرد که بسیار سبک هستند. به دلیل سبک بودن به راحتی قابل حمل می باشند و از دوام بالایی برخوردار هستند. همچنین جهت سهولت جابه جایی دارای دسته می باشد. استفاده کردن از سبد های حصیری زیبایی دکور های شما را دو چندان می کند.'),
(5, 'ظرف آب نقره ای قلم کاری', 2, 3300000, 'kase-ghalamzani.jpg', 'ظروف نقره نما که از آن به عنوان ظروف شبه نقره یا ظروف آبکاری نقره هم یاد می شود به ظروفی گفته می شود که از جنس نقره نیستند و بر روی آن روکش یا لایه ای از نقره گذاشته شده است.\r\nبه عنوان مثال جنس بدنه ظرف از مس، برنج یا نیکل است و سپس بر روی آن لایه ایی از فلز نقره با همان عیار 925 یا درجه خلوص 92.5% گذاشته می شود. خرید قلم زنی اصفهان در قالب ظروف مسی و برنجی با تنوع بالا برای مشتریان گرامی فروشگاه در نظر گرفته شده است.\r\nطراحی ظروف قلمزنی شبه نقره اصفهان برای اکثر سلیقه ها در نظر گرفته شده است و با توجه به این موضوع از محبوبیت ویژه ایی برخوردار می باشند.'),
(6, 'ظروف رزینی', 5, 140000, 'kase-sonati.jpg', 'ظروف رزینی، با ترکیبی از شفافیت، رنگ‌آمیزی و ابعاد مختلف، یک ظاهر شگفت‌انگیز و جذاب دارند که در زندگی روزمره ما وارد شده‌اند. این ظروف می‌توانند به عنوان سفره، کمد، دکوراسیون داخلی و یا حتی جزئی از لوازم تزیینی برای مراسم‌ها و مراسم خاص استفاده شوند. فرآیند ساخت آن‌ها نیز بسیار جذاب و خلاقانه است؛ از طراحی الگوها گرفته تا ایجاد اثرات ویژه با رنگ‌آمیزی و افزودن جزئیات.'),
(7, 'کاشی لعابی', 13, 17000, 'kashi-haft-rang.jpg', 'کاشی ها از مهمترین مصالح ساختمانی می باشند که به طبع تقاضایی که دارند در مدل های متفاوتی تولید می شوند؛ بنابراین با نام های مختلفی شناخته می شوند و اکثر آنها از طریق ویژگی های ظاهری قابل تمایز می باشند.\r\nمواد اولیه مرغوب و استفاده از روش های تولید مناسب منجر به پیدایش کیفیتی ناب و منحصر به فرد در انواع کاشی لعابی سراج شده است، همچنین بهره مندی از اندازه ها و برش های دقیق و داشتن لعاب های باکیفیت بر روی کاشی ها همگی نشان از کیفیت بالای این کاشی ها می باشد؛ بنابراین تمامی ویژگی های خوب و لازم برای یک کاشی باکیفیت را دارند که این امر دلیلی بر حسن شهرت آنها و استفاده بسیار از آنها هم می باشد.'),
(8, 'گلدان میناکاری', 2, 780000, 'kooze-minakari.jpg', 'گلدان مینا کاری، یکی از وسایل تزئینی و کاربردی است که تقریبا در همه ی خانه های ایرانی بدون استثنا وجود داشته و دارد. به ندرت و به سختی می توان خانه ای را پیدا کرد که در آن حتی یک گلدان هم وجود نداشته باشد. گلدانهایی در آن ها گل های طبیعی یا مصنوعی قرار دارند و یا اصلا گلی در آن ها نیست و خود گلدان به تنهایی جنبه تزئینی و دکوری دارد.'),
(9, 'کوزه سفالی خمره ای', 15, 120000, 'kooze-sofali-khaksefid.jpg', 'ابعاد: \r\nارتفاع: 110 سانتی متر\r\n\r\nقطر دهنه: 55 سانتی متر\r\n\r\nکالکشن سفال\r\nگلدان های دست ساز ساخته شده با سفال که در مدل های کاسه ای، خمره ای و استوانه ای، موجود می باشند.\r\n\r\nتمامی گلدان ها از قسمت کف دارای یک سوراخ جهت تخلیه ی آب گیاه می باشند. به همین منظور یک زیرگلدانی آهنی به رنگ گلدان در قسمت زیرین آن قرار می گیرد.\r\n\r\nویژگی ظاهری محصول\r\nرنگ تمامی گلدان ها به صورت دست ساز و طبیعی ترکیب و ساخته شده است.\r\n\r\nایده پشت اثر\r\nهنر باستانی سفالگری\r\n\r\nنحوه نگه داری و شست و شو\r\nقابل شست و شو با دستمال مرطوب و آب بدون استفاده مواد شوینده شیمیایی می باشد.'),
(10, 'ست لوازم چرمی کیف', 2, 890000, 'majmoe-charmi.jpg', 'این ست هدیه چرم شامل کیف پول، جاکلیدی، جاکارتی، تسمه و سگک کمربند می شود که در داخل یک جعبه چوبی بسیار شکیل قرار می گیرند. این پکیج کامل هرآنچه که یک آقای شیک پوش نیاز دارد را با بهترین کیفیت به شما ارائه می دهد. این ست از چرم طبیعی باکیفیت بالا تولید شده و دوخت و دوز و فرآیندهای تولید آن با دقت و وسواس بسیار انجام شده است.'),
(11, 'ظرف دیزی سفالی', 4, 1950000, 'majmoe-kooze-sofali.jpg', 'در هنگام استفاده هرگز روی شعله مستقیم قرار ندهید و حتما از شعله پخش کن استفاده کنید. قبل از مصرف سطح داخلی و خارجی را با دمبه یا روغن جامد چرب کنید و مقداری حرارت ملایم بدهید تا دیزی اب بندی شود'),
(12, 'ظروف مسی زنجان', 3, 560000, 'majmoe-zoroof-mesi.jpg', 'ظرف مسی زنجان به دلیل سطح کیفی بالایی که دارد، کمی گران می باشد اما ارزش خرید بالایی دارد. بعلاوه شما صاحب ظروف مسی مرغوبی شده اید که خاصیت درمانی دارند. این ظروف دارای امتیازات فراوانی است، که فقط یک کدبانو می تواند متوجه آنها شود. البته باید در نگهداری این ظروف کوشا بود و هر گاه این ظروف به رنگ سیاه تغییر رنگ داد، بایستی برای سفید کردن دوباره آنها اقدام نمود.'),
(13, 'سفره قلمکار اصفهان', 8, 4500000, 'parche-ghalamkari.jpg', 'برای شستن پارچه قلمکار باید از آب سرد یا حداقل زیر دمای 30 درجه سانتی گراد استفاده کنید. شوینده های ضعیف تر را برای شست و شوی این محصو در نظر بگیرید. سعی کنید قبل از شست و شوی کامل پارچه ابتدا مقداری از شوینده ی مدنظر خود را در گوشه ای از پارچه که زیاد دیده نمی شود امتحان کنید. اگر پارچه آسیب ندید یعنی رنگ و نقش آن خراب نشد می توانید از آن شوینده برای کل پارچه ی خود استفاده کنید.'),
(14, 'فرش دستبافت', 3, 160000000, 'farsh-tabrizi.jpg', 'فرش دستباف ایرانی چه توسط دستان هنرمندان عشایر، چه توسط دستان ماهر شهرنشینان یا حومه نشینان بافته شود، ثمره هزاران گرهی است که از پشم یا ابریشم در نهایت دقت به روشی خاص دور هر تار چله قالی زده شده است. هر فرش طرح و داستانی خاص خود را دارد، بعضی فرش‌ها از روی نقشه‌ای پیچیده بافته می‌شود و بعضی فرش‌ها الهام گرفته از ذوق هنری بافنده آن و ملهم از محیط پیرامون و روش زندگی وی است. پس از آن که بافنده تک تک گره‌ها را با نخی به رنگ مناسب، مطابق نقشه زد و یک رج کامل شد، بافنده با دفه روی گره‌های تازه زده شده می‌کوبد تا گره‌ها ثابت شوند و رج قبلی و رج جدید از هم جدا شود. بافتن یک فرش ماه‌ها یا حتی سال‌ها طول می‌کشد تا خریدار فرش دستبافت گنجی را به خانه ببرد که هم زیبا است و هم بادوام و کاربردی.'),
(15, 'تابلو قلم زنی', 4, 1510000, '-قلمزنی6.jpg', 'تابلو دیواری قلمزنی مسی یکی از آثار زیبا و هنرمندانه صنایع دستی اصفهان است که با دقت و ظرافت بالا طراحی و اجرا شده است. این تابلو، نمادی از فرهنگ و هنر ایرانی با نقوش غنی و متنوع گل و مرغ، که نماد عشق و زیبایی در هنر ایرانی به شمار می‌روند، به شمار می‌آید.\r\nقاب خاتم‌کاری این تابلو نیز به زیبایی طراحی شده و جلوه‌ای ویژه به اثر می‌بخشد. خاتم‌کاری، تکنیکی است که با استفاده ازفلز برنج،استخوان شتر، چوب‌های رنگی و طرح‌های هندسی، قاب‌هایی با زیبایی منحصر به فرد ایجاد می‌کند. این ترکیب از قلمزنی و خاتم‌کاری، علاوه بر زیبایی، نشان‌دهنده مهارت و دقت هنرمندان اصفهانی است.\r\nاین تابلو نه تنها یک اثر هنری زیبا برای تزئین منزل است، بلکه می‌تواند به عنوان یک هدیه خاص و فرهنگی ماندگار برای خانه و محل کار جدید، روز مادر و پدر، تولد، سالگرد ازدواج، عید نوروز، هدیه مدیریتی،عروسی نیز مورد استفاده قرار گیرد. با قرار دادن این تابلو در فضای زندگی خود، می‌توانید جلوه‌ای از هنر و تاریخ غنی ایران را به نمایش بگذارید');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `realname` varchar(70) NOT NULL COMMENT 'نام واقعی',
  `username` varchar(30) NOT NULL COMMENT 'نام کاربری',
  `password` varchar(30) NOT NULL COMMENT 'رمز عبور',
  `email` varchar(50) NOT NULL COMMENT 'پست الکترونیک',
  `user_type` int(1) NOT NULL COMMENT 'نوع کاربر'
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci COMMENT='جدول کاربران';

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`realname`, `username`, `password`, `email`, `user_type`) VALUES
('admin', 'admin', 'admin', 'admin@iranianshop.ir', 1),
('alireza', 'AC7', 'alireza777', 'alirezachoupani4@gmail.com', 0),
('mmdamin', 'jvd', 'jvd1400', 'mmdjvd@gmail.com', 0);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `messages`
--
ALTER TABLE `messages`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `orders`
--
ALTER TABLE `orders`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`username`),
  ADD KEY `username` (`username`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `messages`
--
ALTER TABLE `messages`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT COMMENT 'کد پیام', AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `orders`
--
ALTER TABLE `orders`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT COMMENT 'شماره سفارش', AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `products`
--
ALTER TABLE `products`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT COMMENT 'کد کالا', AUTO_INCREMENT=20;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
